Repository: yonas-forks/code
Catalog: po/extra/*.po
Languages: ca, es, ja, pl, pt_br, tr

source: Code
ca: Codi
ja: コード
pl: Kod
tr: Kod

source: The editor that works for you
ca: L'editor que us funciona
es: El editor que trabaja para usted
ja: 便利なエディター
pl: Edytor, który działa dla ciebie
pt_br: O editor que funciona para você
tr: Sizin için çalışan metin editörü

source: Whether you're writing in Markdown or managing a complex app codebase, Code is the lightweight but full-featured editor for you. It auto-saves your files to ensure they're always up-to-date, and it remembers your tabs so you never lose your spot—even between sessions.
ca: Tant si escriviu a Markdown com si gestioneu una base de codis d’aplicacions complexa, el Code és l’editor lleuger però amb totes les funcions. Desa automàticament els fitxers per assegurar-se que estiguin sempre actualitzats i recorda les pestanyes perquè mai no perdeu el punt, fins i tot entre sessions.
es: Ya sea que esté escribiendo en Markdown o administrando un código de una aplicación compleja, Code es el editor liviano pero con todas las funciones para usted. Code guarda automáticamente sus archivos para asegurarse de que estén siempre actualizados y recuerda sus pestañas para que nunca pierda su trabajo, incluso entre sesiones.
ja: Markdown で文書を作成するときも、複雑なアプリのソースコードを管理するときも、軽量ながら高機能な“コード”はぴったりです。ファイルを自動保存して、常に最新の状態を維持します。また、タブを保存し次回起動時に復元するので、時間が経っても最後に編集した箇所を見失うことはありません。
pl: Nieważne czy piszesz dokument w Markdownie czy zarządzasz skomplikowanym kodem aplikacji, Kod jest lekkim, lecz w pełni funkcjonalnym edytorem dla Ciebie. Automatycznie zapisuje Twoje pliki by zapewnić, że zawsze są aktualne, oraz zapamiętuje Twoje zakładki, więc nigdy nie tracisz miejsca, w którym skończyłeś – nawet pomiędzy sesjami.
pt_br: Não importa se você está escrevendo em Markdown ou gerenciando códigos complexos, o Code é o editor leve, mas completo, para você. Ele salva automaticamente seus arquivos para garantir que eles estejam sempre atualizados e lembra suas guias para que você nunca perca seu lugar — mesmo entre as sessões.
tr: İster Markdown formatında yazıyor, ister karmaşık bir uygulama kod tabanını yönetiyor olun, Kod sizin için hafif ama tam özellikli bir düzenleyicidir. Her zaman güncel olduklarından emin olmak için dosyalarınızı otomatik olarak kaydeder ve sekmelerinizi hatırlar, böylece oturumlar arasında bile yerinizi asla kaybetmezsiniz.

source: Designed around a project-based workflow, Code knows about your separate codebases. It comes with helpful Git integration to create and switch between branches and show changed files and lines within your projects.
ca: Dissenyat al voltant d’un flux de treball basat en projectes, el Code coneix les vostres bases de codis separades. Inclou una integració útil amb Git per crear i canviar entre branques i mostrar fitxers i línies canviats als projectes.
es: Diseñado en torno a un flujo de trabajo basado en proyectos, Code reconoce sus distintas fuentes de código. Viene con una útil integración de Git para crear y cambiar entre ramas y mostrar archivos y líneas modificados dentro de sus proyectos.
ja: “コード”はプロジェクト単位のワークフロー向けにデザインされているので、コードベースごとに認識されるようになっています。便利な Git との統合機能が搭載されており、ブランチを作成したり変更したり、プロジェクト内のファイルや行の差分を表示したりできます。
pl: Zaprojektowany z myślą o pracy z projektami, Kod wie o twoich osobnych repozytoriach kodu. Jest wyposażony w pomocną integrację z Gitem, by tworzyć i zmieniać branch'e oraz pokazywać zmienione pliki i linie kodu w twoich projektach.
pt_br: Desenhado em torno de um fluxo de trabalho baseado em projetos, o Code sabe como separar suas bases de código. Vem com o Git integrado para criar e alternar entre branches e mostrar arquivos e linhas modificadas dentro de seus projetos.
tr: Proje tabanlı bir iş akışı için tasarlanan Kode, ayrı kod tabanlarınızı bilir. Dallar oluşturma, bunlar arasında geçiş yapmak ve projelerinizdeki değişen dosya ve satırları göstermek için yararlı Git entegrasyonuyla birlikte gelir.

source: Work with your language: whether you're crafting code in Vala, scripting with PHP, or marking things up in HTML, Code has you covered. Experience full syntax highlighting with nearly all programming, scripting, and markup languages.
ca: Funciona amb la vostre llenguatge. Tant si elaboreu codi en Vala, feu scripts amb PHP o marqueu coses en HTML, el Codi us té cobert. Experimenteu el realçament complet de sintaxi amb gairebé tota la programació, seqüències d'ordres i llenguatges de marcatge.
es: Trabaje con su lenguaje: ya sea creando código en Vala, creando scripts con PHP o maquetando en HTML, Code lo tiene todo cubierto. Experimente el resaltado de sintaxis completo con casi todos los lenguajes de programación, scripts y lenguajes de marca.
ja: あの言語にも、この言語にも、対応。Vala でコーディングしていても、PHP でスクリプティングしていても、HTML でマークアップしていても、“コード”はあなたをサポートします。完璧なシンタックスハイライトが、ほぼすべてのプログラミング言語・スクリプティング言語・マークアップ言語で利用可能です。
pl: Działa w Twoim języku, niezależnie czy piszesz kod w Vala, skrypt PHP, czy markery w HTML-u, Kod Ci w tym pomoże. Doświadcz pełnego kolorowania składni w prawie wszystkich językach programowania, skryptowych i markupowych.
pt_br: Funciona com a sua linguagem: se você está criando códigos em Vala, criando scripts em PHP, ou fazendo marcações em HTML, o Code lhe ajuda. Experimente o reconhecimento completo de sintaxe com quase todas as linguagens de programação, script e marcação.
tr: Kendi dilinizle çalışın: ister Vala ile kodluyor olun, ister PHP ile script yazıyor veya HTML dosyası düzenliyor olun, Kod her zaman yanınızda. Tam sözdizimi vurgulaması ile neredeyse bütün programlama dilleri ile uyumun tecrübesini yaşayın.

source: Find anything in your current file, specific folders, or your whole project with options for case-sensitivity and regular expressions.
ca: Cerqueu qualsevol cosa al fitxer actual, a carpetes específiques o a tot el projecte amb les opcions per distingir entre majúscules i minúscules i expressions regulars.
es: Encuentre cualquier cosa en el archivo actual, en carpetas específicas o en todo su proyecto con opciones de distinción entre mayúsculas y minúsculas y expresiones regulares.
ja: 表示中のファイルや特定のフォルダー、プロジェクト全体を対象に自由自在に検索できます。大文字・小文字の区別や正規表現を使った検索も可能です。
pl: Znajdź cokolwiek w aktualnym pliku, konkretnych folderach lub w całym twoim projekcie z opcjami rozróżnienia małych i wielkich liter oraz wyrażeniami regularnymi.
pt_br: Encontre qualquer coisa no seu arquivo atual, pastas específicas ou em todo o seu projeto com opções de diferenciar por maiúsculas/minúsculas e expressões regulares.
tr: Büyük/küçük harf duyarlılığı ve normal ifadeler arama seçenekleriyle mevcut dosyanızda, belirli klasörlerde veya tüm projenizdeki herhangi bir şeyi bulun.

source: Smart features throughout: automatic indentation, smart cut/copy behavior, visible whitespace for selected text and at the end of lines by default, and optional extensions for Markdown actions, spell checking, whitespace trimming, word completion, and more.
ca: Funcions intel·ligents: sagnat automàtic, comportament de retall / còpia intel·ligent, espai en blanc visible per al text seleccionat i al final de les línies de manera predeterminada, i extensions opcionals per a accions del Markdown, correcció ortogràfica, retall d’espais en blanc, acabament de paraules i molt més.
es: Funciones inteligentes en todas partes: sangría automática, comportamiento inteligente de cortar/copiar, espacios en blanco visibles para el texto seleccionado y al final de las líneas de forma predeterminada, y extensiones opcionales para acciones de Markdown, revisión ortográfica, eliminación de espacios en blanco, compleción de palabras y más.
ja: 便利な機能がこんなにも。自動インデント、“便利な行の切り取り/コピー”機能、デフォルトで選択中のテキストと行末の空白を表示する機能、オプションで Markdown アクション・スペルチェック・余分な空白の削除・単語補完などの機能も。
pl: Inteligentne funkcje wszędzie tam gdzie to możliwe: automatyczne wcięcia, inteligentne zachowanie przy wycinaniu/kopiowaniu, widoczne białe znaki dla zaznaczonego tekstu oraz na końcach linii domyślnie oraz opcjonalne rozszerzenia dla akcji Markdown, sprawdzanie pisowni, przycinanie białych znaków, dokańczanie słów i więcej.
pt_br: Recursos inteligentes em todo o documento: recuo automático, comportamento inteligente de corte/cópia, espaço em branco visível para texto selecionado e no final das linhas por padrão, e extensões opcionais para ações de Markdown, verificação ortográfica, corte de espaços em branco, conclusão de palavras e muito mais.
tr: Baştan sona akıllı özellikler: otomatik girinti, akıllı kesme/kopyalama davranışı, varsayılan olarak seçilen metin için ve satırların sonundaki boşlukları gösterir, isteğe bağlı olarak Markdown eylemleri, yazım denetimi, boşluk düzeltme, sözcük tamamlama ve daha fazlası için uzantılar.

source: Adapt Code to your workflow: you can tweak the behavior and interface as needed with a handful of useful and well-considered extensions and preferences.
ca: Adapteu el Codi al vostre flux de treball: podeu modificar-ne el comportament i la interfície segons sigui necessari amb un grapat d’extensions i preferències útils i ben considerades.
es: Adapte Code a su flujo de trabajo: puede modificar el comportamiento y la interfaz según sea necesario con un puñado de extensiones y preferencias útiles y bien consideradas.
ja: “コード”を自身のワークフローに導入しましょう。厳選された便利な拡張機能と設定を使って、挙動とインターフェースを必要に応じて調整できます。
pl: Przystosuj Kod do twojego stylu pracy: możesz dostosować zachowania oraz interfejs do twoich potrzeb przy użyciu kilku użytecznych oraz przemyślanych wtyczek i ustawień.
pt_br: Adapte o Code ao seu fluxo de trabalho: você pode ajustar o comportamento e a interface conforme necessário com algumas extensões e preferências úteis e bem pensadas.
tr: Kod uygulamasını iş akışınıza uyarlayın: Bir avuç kullanışlı ve iyi düşünülmüş uzantı ve tercihle davranışı ve arayüzü gerektiği gibi değiştirebilirsiniz.

source: There's a ton more:
ca: Hi ha moltes més coses:
es: Hay mucho más:
ja: その他の機能:
pl: To wciąż nie wszystko:
pt_br: Há muito mais:
tr: Bir ton daha özellik var:

source: Solarized Light, Solarized Dark, and High Contrast color schemes that affect the whole UI
ca: Esquemes de colors Solarized Light, Solarized Dark i High Contrast que afecten tota la interfície d’usuari
es: Esquemas de color Solarized Light, Solarized Dark y Alto Contraste que afectan a toda la interfaz de usuario
ja: UI 全体に反映される、Solarized Light、Solarized Dark、ハイコントラストカラースキーム
pl: Motywy słoneczny jasny, słoneczny ciemny oraz wysoki kontrast wpływające na cały interfejs
pt_br: Esquemas de cores Solarized Light, Solarized Dark e Alto Contraste que afetam toda a UI
tr: Tüm kullanıcı arayüzünü etkileyen Açık Renk Tema, Koyu Renk Tema ve Yüksek karşıtlık renk şemaları

source: Togglable sidebar to fit your workflow
ca: Barra lateral commutable per adaptar-se al flux de treball
es: Barra lateral con visibilidad opcional para adaptarse a su flujo de trabajo
ja: ワークフローに応じて表示・非表示が可能なサイドバー
pl: Przełączalny panel boczny by pracować tak jak chesz
pt_br: Barra lateral alternável para ajustar seu workflow
tr: İş akışınıza uyacak şekilde değiştirilebilir kenar çubuğu

source: Smart indentation and .editorconfig support
ca: Sagnat intel·ligent i suport per a .editorconfig
es: Sangría inteligente y compatibilidad con .editorconfig
ja: 便利なインデント機能と .editorconfig への対応
pl: Inteligentne wcięcia i wsparcie dla .editorconfig
pt_br: Indentação inteligente e suporte a arquivos .editorconfig
tr: Akıllı girintili yazma ve .editorconfig desteği

source: Browser-class tabs with drag-and-drop, duplication, undo closing, and tab history
ca: Pestanyes de la classe del navegador amb arrossegar i deixar anar, duplicació, desfer el tancament i historial de pestanyes
es: Pestañas tipo navegador con función de arrastrar y soltar, duplicar, deshacer el cierre e historial de pestañas
ja: ドラッグ & ドロップ、タブの複製、閉じたタブの復元、タブ履歴など、ブラウザー並みの機能を持つタブ
pl: Karty w stylu przeglądarek z przeciąganiem, duplikacją, cofnięciem zamknięcia oraz historią kart
pt_br: Guias com arrastar e soltar, duplicação, desfazer fechamento e histórico de guias
tr: Sürükle ve bırak, çoğaltma, kapatmayı geri alma ve sekme geçmişine sahip tarayıcı sınıfı sekmeler

source: Display the current line and character—and quickly jump to a new line
ca: Es mostra la línia i el caràcter actuals i se salta ràpidament a una línia nova.
es: Muestra la línea y el carácter actuales, y salte rápidamente a una nueva línea
ja: 現在カーソルのある行と列を表示します。そして、別の行に瞬時に移動できます
pl: Wyświetl aktualną linię oraz znak oraz szybko przejdź do nowej linii
pt_br: Exiba a linha e o caractere atuais e pule rapidamente para uma nova linha
tr: Geçerli satırı ve karakteri görüntüleyin ve hızla yeni bir satıra geçin

source: Scroll past the end of the file so you can keep the current line where it's comfortable
ca: Desplaceu-vos fins al final del fitxer per mantenir la línia actual on sigui còmode.
es: Desplácese más allá del final del archivo para que pueda mantener la línea actual donde le resulte más cómodo
ja: ファイルの最終行より先にもスクロールできるので、編集中の行をお好きな位置に表示できます
pl: Przejdź do końca pliku by przechować aktualną linię tam gdzie jest wygodnie
pt_br: Vá além do final do arquivo para que você possa manter a linha atual onde for confortável
tr: Dosyanın son satırını istediğiniz yere kaydırın, böylece geçerli satırı rahat olduğu yerde tutabilirsiniz

source: Optional mini-map to make navigating large files easier
ca: Minimapa opcional per facilitar la navegació per fitxers grans
es: Minimapa opcional para facilitar la navegación en archivos grandes
ja: 行数の多いファイルでも移動が簡単になるミニマップ機能もオプションで用意
pl: Opcjonalna mini-mapa by łatwiej nawigować w dużych plikach
pt_br: Minimapa opcional para facilitar a navegação em arquivos grandes
tr: Büyük dosyalarda gezinmeyi kolaylaştırmak için isteğe bağlı mini harita

source: Improvements:
ca: Millores:
es: Mejoras:
ja: 改善点:
pl: Ulepszenia:
pt_br: Melhorias:
tr: İyileştirmeler:

source: Minor updates:
ca: Actualitzacions menors:
es: Actualizaciones menores:
ja: マイナーアップデート:
pl: Mniejsze aktualizacje:
pt_br: Pequenas atualizações:
tr: Küçük güncellemeler:

source: The terminal pane is now synchronized with the Terminal app foreground, background and palette settings
ca: El plafó del terminal ara està sincronitzat amb la configuració de primer pla, fons i paleta de l'aplicació Terminal.
es: El panel de terminal se sincroniza ahora con la configuración de colores, fondo y paletas de la aplicación de Terminal

source: The terminal pane is now synchronized with GNOME font and cursor blink settings
ca: El plafó del terminal ara està sincronitzat amb la configuració de font i parpelleig del cursor del GNOME.
es: El panel de terminal se sincroniza ahora con la configuración de fuentes y parpadeo de cursor de GNOME

source: Updated translations
ca: Traduccions actualitzades
es: Traducciones actualizadas
ja: 翻訳の更新
pl: Zaktualizowano tłumaczenia
pt_br: Traduções atualizadas
tr: Çeviriler güncellendi

source: The Project Chooser context menu now includes an option to clone a remote git repository
ca: El menú contextual del Selector de projectes ara inclou una opció per clonar un dipòsit git remot.
es: El menú contextual de proyectos ahora incluye una opción para clonar un repositorio git remoto
ja: プロジェクト選択コンテキストメニューに、リモートの Git リポジトリをクローンするオプションを追加

source: The "Open Folder" action now appears in the Project Chooser context menu
ca: L'acció d'obrir una carpeta apareix ara al menú contextual del Selector de projectes.
es: La acción de «Abrir carpeta» ahora aparece en el menú contextual del botón de proyectos
ja: "フォルダーを開く" アクションを、プロジェクト選択コンテキストメニューの中に移動

source: The Vala symbol pane now shows a spinner while loading
ca: La taula de símbols de Vala ara mostra una baldufa mentre es carrega.
es: El panel de símbolos de Vala ahora muestra un indicador giratorio mientras se carga
ja: Vala シンボルペインの読み込み中にスピナーを表示するように修正

source: The filter in the C symbol pane now works
ca: El filtre de la taula de símbols C ara funciona.
es: El filtro del panel de símbolos de C ahora funciona
ja: C 言語シンボルペインでのフィルター機能が動作するように修正

source: A new gutter is added for adding/removing edit marks that can be navigated between with keyboard shortcuts
ca: S'afegeix un nou canal per afegir / suprimir marques d'edició entre les quals es pot navegar amb dreceres de teclat.
es: Se ha añadido un nuevo espacio para agregar o quitar marcadores, los cuales se pueden navegar con atajos del teclado
ja: キーボードショートカットで移動可能なブックマークを追加/削除するためのコンテキストメニューを追加
pl: Dodano nowy rowek pozwalający na dodanie/usunięcie zakładek edycyjnych pomiędzy którymi można nawigować przy użyciu skrótów klawiszowych

source: Remote branches may now be opened from the "Branch" menu
ca: Ara es poden obrir branques remotes des del menú Branca.
es: La ramas remotas ahora se pueden abrir desde el menú de «Ramas»
ja: "ブランチ" メニューからリモートブランチにチェックアウトできる機能を追加
pl: Gałęzie zdalne mogą być teraz otwarte w menu „Gałąź”

source: Options to overwrite or cancel are given when switching branch with uncommitted changes
ca: Es donen opcions per sobreescriure o cancel·lar quan es canvia de branca amb canvis no confirmats.
es: Ahora se ofrecen opciones para sobrescribir o cancelar cambios no persistidos («uncomitted») cuando se cambia a otra rama
ja: コミットしていない変更がある状態でブランチを切り替えた場合に、上書きするかキャンセルするか選べる機能を追加
pl: Możliwość nadpisania bądź anulowania przy zmieni gałęzi z niescommitowanymi zmianami

source: The network can now be accessed from within the Flatpak
ca: Ara es pot accedir a la xarxa des de dins del Flatpak.
es: Ahora se tiene acceso a redes desde el paquete de Flatpak
ja: Flatpak 版においてネットワークアクセスできるように修正
pl: Sieć jest teraz dostępna wewnątrz środowiska Flatpak

source: The branch names in the "Branch" submenus are now sorted alphabetically
ca: Els noms de les branques dels submenús de la Branca ara estan ordenats alfabèticament.
es: Ahora las ramas ubicadas en los sub-menús de «Ramas» se organizan alfabéticamente
ja: "ブランチ" サブメニュー内のブランチ名がアルファベット順に並ぶように修正
pl: Nazwy gałęzi w podmenu „Gałąź” są teraz posortowane alfabetycznie

source: The extension list now has switches instead of checkboxes in order to provide a larger target
ca: La llista d'extensions ara té interruptors en lloc de caselles de selecció per tal de proporcionar un objectiu més ampli.
es: Las lista de extensiones ahora usan botones de alternancia en vez de casillas, lo cual proporciona un área más grande para hacer clic
ja: 押下可能領域が大きくなるよう、拡張機能リスト内のチェックボックスをスイッチに置き換え
pl: Lista rozszerzeń ma teraz przełączniki zamiast checkboxów aby zwiększyć ich pole powierzchni

source: The terminal pane now implements smart copy-paste and follows the "natural-copy-paste" setting of Terminal
ca: El plafó del terminal ara implementa la funció de copiar i enganxar intel·ligentment i segueix la configuració de copiar i enganxar de tipus natural del Terminal.
es: El panel de la terminal ahora implementa copiar-pegar de manera inteligente y sigue el estilo «copiar-pegar natural» de la Terminal
ja: ターミナルペインにスマートコピー & ペースト機能を実装し、“ターミナル” の "ナチュラルコピー & ペースト" の設定に従うように修正
pl: Panel terminala wspiera teraz smart kopiowanie i wklejania oraz respektuje ustawienie "natural-copy-paste" Terminala

source: The Vala symbol pane now gives more information in the tooltips
ca: La taula de símbols de Vala ara dona més informació a les descripcions emergents.
es: El panel de símbolos de Vala ahora ofrece más información en la descripción emergente
ja: Vala シンボルペインでのツールチップにより多くの情報を表示するように修正
pl: Panel symboli Vala pokazuje teraz więcej informacji w tooltipie

source: Launcher actions now have icons
ca: Les accions del llançador ara tenen icones.
es: Las acciones del lanzador ahora tienen íconos
ja: ランチャーアクションにアイコンを追加
pl: Akcje wyzwalacza mają teraz ikony

source: Opening and immediately closing a new document no longer prevents further documents being opened
ca: Obrir i tancar immediatament un document nou ja no impedeix que s'obrin més documents.
es: El abrir e inmediatamente cerrar un documento nuevo ya no evita abrir más documentos
ja: 新しいドキュメントを開いてすぐ閉じると、以降ドキュメントを開けなくなる問題を修正

source: The Vala symbol pane may only block the UI for a limited time if there are a large number of symbols
ca: La taula de símbols de Vala només pot blocar la interfície d'usuari durant un temps limitat si hi ha un gran nombre de símbols.
es: El panel de símbolos de Vala y solamente bloquea la interfaz por un tiempo limitado si existen demasiados símbolos
ja: 大量のシンボルがあっても Vala シンボルペインが UI を長時間ブロックしないように修正

source: The "Open in …" menu is no longer empty when running as Flatpak
ca: El menú d'obrir en un altre lloc ja no està buit quan s'executa com a Flatpak.
es: El menú «Abrir en...» ya no se encuentra vacío si Code se ejecuta como un paquete de Flatpak
ja: Flatpak 版で "指定した方法で開く" メニューが空で表示される問題を修正

source: The search term now persists until editing or closing the search bar.
ca: El terme de cerca ara persisteix fins que s'editi o es tanqui la barra de cerca.
es: Los términos de búsqueda ahora persisten sin cambios hasta editarlos, o al cerrar la barra de búsqueda.
ja: 検索バーに文字入力したり閉じたりしない限り、検索語句を消去しないように修正。

source: No longer allow the parent or child of an open project to be itself opened as a project
ca: Ja no es permet que el pare o el fill d'un projecte obert s'obri com a projecte.
es: Ya no se permite que un proyecto padre o hijo abierto pueda abrirse el mismo como proyecto
ja: 開いているプロジェクトの親または子をプロジェクトとして開くことができないように修正

source: The active project dropdown now keeps in sync
ca: El menú desplegable del projecte actiu ara es manté sincronitzat.
es: Ahora el menú desplegable del proyecto abierto se mantiene sincronizado
ja: アクティブなプロジェクトのドロップダウンが同期されるように修正

source: Numbered lists are now handled correctly by Markdown plugin
ca: Les llistes numerades ara es gestionen correctament amb el complement Markdown.
es: Las listas numeradas ahora funcionan correctamente bajo la extensión de Markdown
ja: Markdown プラグインが番号付きリストを適切に処理するように修正

source: The highlighting plugin now works with selections of more than one word
ca: El complement de ressaltar ara funciona amb seleccions de més d'una paraula.
es: La extensión de resaltado ahora funciona con selecciones de más de una palabra
ja: 選択されている単語が 1 語より多くてもハイライトプラグインが機能するように修正

source: The "Open in …" menu is now sorted and includes a "Terminal Pane" entry
ca: El menú d'obrir en un altre lloc ara està ordenat i inclou una entrada al plafó del terminal.
es: El menú de «Abrir en...» está ahora mejor organizado e incluye una entra de «Panel de la terminal»
ja: "指定した方法で開く" メニューがアルファベット順で並ぶように修正。また、"ターミナルペイン" のメニュー項目を含めるように修正

source: Folders containing may items now expand faster without blocking the UI
ca: Les carpetes que contenen molts elements ara s'expandeixen més ràpidament sense blocar la interfície d'usuari.
es: Los archivos que contengan muchos elementos ahora se expande más rápido sin bloquear la interfaz
ja: 大量の項目を含むフォルダーを展開しても、UI をブロックせず高速に動作するように修正

source: Symbol Pane now always scrolls document to selected symbol
ca: La taula de símbols ara sempre desplaça el document fins al símbol seleccionat.
es: El panel de símbolos ahora siempre desplaza el documento al seleccionar un símbolo
ja: シンボルペインでシンボルを選択すると、常にドキュメントのその位置にスクロールするように修正

source: Add symbol filter to Outline pane
ca: Addició d'un filtre de símbols al plafó de l'esquema
es: Se agregó un filtro para símbolos en la vista de esquema
ja: シンボルフィルターを“アウトライン”ペインに追加
pl: Dodano filtr symboli do panelu podglądu
pt_br: Adicionar filtro de símbolo ao painel Contorno
tr: Anahat bölmesine sembol filtresi ekle

source: The Terminal pane now has a settable default directory
ca: El plafó del Terminal ara té un directori predeterminat que es pot configurar.
es: El panel de la terminal ahora tiene una opción para establecer un directorio predeterminado
ja: “ターミナル”ペインのデフォルトディレクトリを設定できるように修正
pl: Karta Terminala ma teraz możliwy do ustawienia domyślny katalog
pt_br: O painel Terminal agora tem o diretório padrão configurável
tr: Terminal bölmesi artık ayarlanabilir bir varsayılan dizine sahip
