Repository: yonas-forks/code
Catalog: po/extra/*.po
Languages: ca, es, ja, pl, pt_br, tr

source: The correct document is now focused after opening Code from an external program
ca: Ara es focalitza el document correcte després d'obrir el Codi des d'un programa extern.
es: El documento correcto ahora se enfoca después de abrir Code desde un programa externo
ja: 外部プログラムから“コード”を開いた際に、開いたドキュメントがフォーカスされるように修正
pl: Poprawny dokument jest teraz sfokusowany po otwarciu Kodu przez zewnętrzny program
pt_br: O documento correto agora é focado após abrir o Code através de um programa externo
tr: Kod'u dış bir programdan açtıktan sonra doğru belgeye odaklanılmaktadır

source: Line duplication is now actioned correctly if there is no selection present
ca: La duplicació de línies ara actua correctament si no hi ha cap selecció.
es: La duplicación de líneas se activa correctamente si no hay una selección presente
ja: 選択中の行がなくても、行の複製が正しく実行されるように修正
pl: Duplikowanie linii jest teraz obsługiwane poprawnie gdy nic nie jest zaznaczone
pt_br: A duplicação de linha agora é acionada corretamente se não houver nenhuma seleção presente
tr: Eğer herhangi bir seçim yoksa satır tekrarı doğru bir şekilde uygulanmaktadır

source: Code no longer crashes when asked to open an unknown URI format
ca: El Codi ja no es bloqueja quan se li demana que obri un format d'URI desconegut.
es: Code no falla al intentar abrir un formato de URI desconocido
ja: 不明な URI 形式を開くように指示されてもクラッシュしないように修正
pl: Otwieranie nieznanych formatów URI w Kodzie nie powoduje już błędu krytycznego
pt_br: O Code não trava mais quando solicitado a abrir um formato de URI desconhecido
tr: Kod; bilinmeyen bir URI formatı açılması istendiğinde artık çökmüyor

source: Edit code files
ca: Editeu fitxers de codi
es: Edite archivos de código
ja: コードファイルを編集します
pl: Modyfikuje pliki z kodem
pt_br: Edite arquivos de código
tr: Kod dosyalarını düzenle

source: Code Editor
ca: Editor de codi
es: Editor de código
ja: コードエディター
pl: Edytor Kod
pt_br: Editor Code
tr: Kod Düzenleyici

source: text;IDE;scratch;code;
ca: text;IDE;scratch;codi;
es: texto;IDE;EID;scratch;código;
ja: text;IDE;scratch;code;テキスト;統合開発環境;コード;
pl: tekst;IDE;scratch;kod;
pt_br: texto;IDE;scratch;código;
tr: metin;IDE;karalama;text;code;scratch;kod;

source: New File
ca: Fitxer nou
es: Archivo nuevo
ja: 新しいファイル
pl: Nowy plik
pt_br: Novo Arquivo
tr: Yeni Dosya

source: New Window
ca: Finestra nova
es: Nueva ventana
ja: 新しいウィンドウ
pl: Nowe okno
pt_br: Nova Janela
tr: Yeni Pencere

source: Run Code as Administrator
ca: Executa el Codi com a administrador
es: Ejecutar Code como administrador
ja: “コード”を管理者として実行
pl: Uruchom Kod jako administrator
pt_br: Executar Code como Administrador
tr: Kodu Yönetici Olarak Çalıştır

source: Authentication is required to run Code as Administrator
ca: Cal autenticació per executar el Codi com a administrador.
es: Necesita autenticarse para ejecutar Code con permisos de administrador
ja: “コード”を管理者として実行するには認証が必要です
pl: Uwierzytelnienie jest wymagane by uruchomić Kod jako administrator
pt_br: A autenticação é necessária para executar o Code como Administrador
tr: Kodu Yönetici olarak çalıştırmak için kimlik doğrulaması gereklidir
