Repository: yonas-forks/code
Catalog: po/extra/*.po
Languages: ca, es, ja, pl, pt_br, tr

source: New Tab Bar with improved animations and Drag-n-Drop
ca: Nova barra de pestanyes amb animacions millorades i arrossegar i deixar anar
es: Se agregaron animaciones mejoradas y la posibilidad de arrastrar y soltar a la nueva barra de pestañas
ja: アニメーションとドラッグ & ドロップを改善した、新しいタブバー
pl: Nowy pasek kart z poprawionymi animacjami przeciągania i upuszczania
pt_br: Nova barra de guias com animações aprimoradas e drag-n-drop
tr: Geliştirilmiş animasyonlar ve Sürükle-Bırak ile Yeni Sekme Çubuğu

source: When opening a file in Code from the commandline or another app, a line/char position or selection range may be specified
ca: Quan s'obre un fitxer al Codi des de la línia d'ordres o una altra aplicació, es pot especificar una posició de línia / caràcter o un interval de selecció.
es: Ahora se puede especificar una línea/carácter o un rango de selección determinado al abrir un archivo en Code desde la línea de comandos u otra aplicación
ja: コマンドラインや他のアプリから“コード”でファイルを開く際に、行番号・列番号や選択範囲を指定する機能を追加
pl: Podczas otwierania pliku w edytorze Kod z poziomu linii poleceń lub innej aplikacji można teraz sprecyzować pozycję kursora na linii lub znaku, lub aktualne zaznaczenie
pt_br: Ao abrir um arquivo no Code a partir da linha de comando ou de outro aplicativo, uma posição de linha/caractere ou intervalo de seleção pode ser especificado
tr: Komut satırından veya başka bir uygulamadan Kod'da bir dosya açıldığında, bir satır/karakter konumu veya seçim aralığı belirtilebilir

source: Add a fuzzy-find plugin which finds files in all open projects
ca: Afegiu un connector de cerca difusa que trobi fitxers a tots els projectes oberts
es: Se ha agregado una extensión de búsqueda global que encuentra archivos en todos los proyecto abiertos
ja: 開いているすべてのプロジェクトを対象にファイルを検索する、あいまい検索プラグインを追加
pl: Dodano plugin dla fuzzy-find przeszukującego pliki we wszystkich otwartych projektach
pt_br: Plugin fuzzy-find que encontre arquivos em todos os projetos abertos
tr: Tüm açık projelerdeki dosyaları bulan bir fuzzy-find eklentisi ekleyin

source: Save and restore the state of the terminal pane
ca: Desa i restaura l'estat del plafó del terminal
es: Se puede guardar y restaurar el estado del panel de la terminal
ja: ターミナルペインの状態を保存・復元するように変更
pl: Zapisywanie i przywracanie stanu panelu terminala
pt_br: Salve e restaure o estado do painel do terminal
tr: Terminal bölmesinin durumunu kaydedin ve geri yükleyin

source: "Find in Folder" now works for all folders and text files, not only ".vala" files
ca: "Troba a la carpeta" ara funciona per a totes les carpetes i fitxers de text, no només amb fitxers ".vala".
es: «Buscar en carpetas» ahora funciona para todas las carpetas y archivos de texto, no solo en archivos «.vala»
ja: "フォルダー内を検索"機能の対象を、".vala"ファイルだけではなくすべてのフォルダーとテキストファイルに変更
pl: „Znajdź w folderze” działa teraz ze wszystkimi folderami i plikami tekstowymi, nie tylko z plikami „.vala”
pt_br: "Localizar na pasta" agora funciona para todas as pastas e arquivos de texto, não apenas para arquivos ".vala"
tr: "Klasörde Bul" artık yalnızca ".vala" dosyaları için değil, tüm klasörler ve metin dosyaları için çalışıyor

source: "Follow System Style" is now fully respected
ca: "Segueix l'estil del sistema" ara es respecta plenament.
es: Se respeta la opción «Seguir el estilo del sistema» completamente
ja: "システムのスタイルに従う"の設定が常に反映されるように修正
pl: „Dopasuj do stylu systemu” jest teraz w pełni respektowane
pt_br: "Seguir o estilo do sistema" agora é totalmente respeitado
tr: "Sistem Stilini Takip Et" artık tam olarak dikkate alınıyor

source: The "--new-tab" commandline option now works
ca: L'opció de línia d'ordres "--new-tab" ara funciona.
es: La línea de comando «--new-tab» (nueva pestaña) ahora funciona correctamente
ja: コマンドラインオプション "--new-tab" が動作しない不具合を修正
pl: Opcja „--new-tab” z linii poleceń działa
pt_br: A opção de linha de comando "--new-tab" agora funciona
tr: "--new-tab" komut satırı seçeneği artık çalışıyor

source: The symbol pane width is now synchronised and saved
ca: L'amplada del plafó de símbols està ara sincronitzada i desada.
es: El ancho del panel de símbolos ahora se sincroniza y se guarda
ja: シンボルペインの幅が同期・保存されるように修正
pl: Szerokość panelu symboli jest teraz synchronizowana i zapisywana
pt_br: A largura do painel de símbolos agora está sincronizada e salva
tr: Sembol bölmesi genişliği artık senkronize ediliyor ve kaydediliyor

source: Project folders are automatically closed if they are externally renamed, moved or deleted
ca: Les carpetes del projecte es tanquen automàticament si es canvien de nom, es mouen o se suprimeixen externament.
es: Ahora las carpetas de proyectos se cierran automáticamente si de manera externa se borran, se mueven o cambian de nombre
ja: プロジェクトフォルダーが外部で名称変更や移動、削除された場合、自動的に閉じるように修正
pl: Foldery projektu są automatycznie zamykane jeśli ich nazwa jest zmieniania, są przenoszone lub usuwane przez zewnętrzne aplikacje
pt_br: As pastas do projeto são fechadas automaticamente se forem renomeadas, movidas ou excluídas externamente
tr: Proje klasörleri, harici olarak yeniden adlandırıldığında, taşındığında veya silindiğinde otomatik olarak kapatılır

source: Fixed temporary backup files persisting under some circumstances
ca: S'han corregit els fitxers de còpia de seguretat temporals que persistien en algunes circumstàncies.
es: Se corrigió que algunos archivos de respaldo temporales persistan bajo algunas circunstancias
ja: 一時バックアップファイルが一部のケースで残り続ける不具合を修正
pl: Naprawiono przypadek gdy pliki tymczasowe nie były usuwane
pt_br: Corrigido arquivos de backup temporários que persistiam em algumas circunstâncias
tr: Bazı durumlarda geçici yedekleme dosyalarının kalıcı olması düzeltildi

source: The Show-Replace action has been improved
ca: S'ha millorat l'acció Mostra-Reemplaça.
es: Se ha mejorado la acción Mostrar-Reemplazar
ja: Show-Replace アクションを改善
pl: Akcja pokaż i zastąp została poprawiona
pt_br: A ação Mostrar-Substituir foi melhorada
tr: Göster-Değiştir eylemi iyileştirildi

source: Search options transferred to searchbar menu
ca: Opcions de cerca transferides al menú de la barra de cerca
es: Las opciones de búsqueda se han transferido a la barra de búsqueda del menú
ja: 検索オプションを検索バーのメニューに移動
pl: Opcje wyszukiwania przekazywane są teraz do menu paska wyszukiwania
pt_br: Opções de pesquisa transferidas para o menu da barra de pesquisa
tr: Arama seçenekleri arama çubuğu menüsüne aktarıldı

source: Whole word search option added
ca: S'ha afegit l'opció de cerca de paraules senceres
es: Se ha agregado la opción de búsqueda completa de palabra
ja: 完全一致検索オプションを追加
pl: Dodano opcję dopasowania całych słów
pt_br: Opção de busca por palavra inteira adicionada
tr: Tüm kelime arama seçeneği eklendi

source: Whole word, case sensitive mode and use regex search settings now persist
ca: La paraula sencera, el mode sensible a majúscules i minúscules i la configuració de cerca d'expressió regular ara persisteixen.
es: Ahora las configuraciones de palabra completa, distinción entre mayúsculas y minúsculas, y expresiones regulares persisten
ja: “完全一致”、“大文字と小文字を区別”、“正規表現を使う”の検索設定が保持されるように修正
pl: Ustawienia całyc słów, dopasowywania wielkości liter i wyszukiwania wyrażeniami regularnymi są teraz zapisywane
pt_br: As configurações de pesquisa de palavra inteira, modo sensível a maiúsculas e minúsculas e uso de regex agora persistem
tr: Tüm kelime, büyük/küçük harfe duyarlı mod ve regex arama ayarlarının kullanımı artık saklanıyor

source: The search bar now updates properly after changing the active document
ca: La barra de cerca ara s'actualitza correctament després de canviar el document actiu.
es: La barra de búsqueda se actualiza apropiadamente al cambiar el documento activo
ja: 表示するドキュメントを変更すると、検索バーも適切に更新されるように修正
pl: Pasek wyszukiwania jest teraz aktualizowany przy zmianie aktywnego dokumentu
pt_br: A barra de pesquisa agora é atualizada corretamente após alterar o documento ativo
tr: Etkin belge değiştirildikten sonra arama çubuğu artık düzgün bir şekilde güncelleniyor

source: Trying to save a document to an unwritable location is now handled better
ca: Intentar desar un document en una ubicació que no es pot escriure ara es gestiona millor.
es: Se maneja mejor el flujo al tratar de guardar un documento en una ubicación sin permisos de escritura
ja: 書き込み不可の場所にドキュメントを保存しようとした際の挙動を改善
pl: Próba zapisania dokumentu w miejscu w którym nie da się zapisywać jest teraz lepiej obsługiwana
pt_br: Tentar salvar um documento em um local não gravável agora é melhor tratado
tr: Bir belgeyi yazılamaz bir konuma kaydetmeye çalışmak artık daha iyi işleniyor

source: The system style is now followed by the symbol outline and when launched without open documents
ca: L'estil del sistema ara el segueix el contorn del símbol i quan es llança sense documents oberts.
es: La vista de esquema y el abrir Code sin documentos abiertos siguen correctamente el estilo del sistema
ja: シンボルアウトラインとドキュメントなしで起動した場合も“システムのスタイルに従う”が機能するように修正
pl: Styl systemowy jest teraz przestrzegany przez zarys symbolu i bez otwartych dokumentów
pt_br: O estilo do sistema agora é seguido quando o Code é iniciado sem documentos abertos
tr: Açık belgeler olmadan başlatıldığında ve sistem stili sembol anahattı tarafından takip ediliyor

source: Mixed case sensitive search now works as expected
ca: La cerca mixta que distingeix entre majúscules i minúscules ara funciona com s'esperava.
es: La búsqueda mixta al distinguir entre mayúsculas y minúsculas ahora funciona como debe
ja: 検索用語に大文字も小文字も含まれる場合の検索機能が、期待通りの挙動になるように修正
pl: Wyszukiwanie z uwzględnieniem wielkości liter działa teraz zgodnie z oczekiwaniami gdy litery są różnej wielkości
pt_br: A pesquisa com diferenciação entre maiúsculas e minúsculas agora funciona conforme o esperado
tr: Karma büyük/küçük harfe duyarlı arama artık beklendiği gibi çalışıyor

source: The search results no longer change unexpectedly when focusing a document
ca: Els resultats de la cerca ja no canvien de manera inesperada quan s'enfoca un document.
es: Los resultados de la búsqueda ya no cambian repentinamente cuando se selecciona un documento en las pestañas
ja: ドキュメントにフォーカスすると意図せず検索結果が変わってしまう不具合を修正
pl: Wyniki wyszukiwania nie zmieniają się niespodziewanie przy skupianiu się na dokumencie
pt_br: Os resultados da pesquisa não mudam mais inesperadamente ao focar um documento
tr: Bir belgeye odaklanıldığında arama sonuçları artık beklenmedik şekilde değişmiyor

source: Now there is always an active project at startup if there are projects in the sidebar
ca: Ara sempre hi ha un projecte actiu a l'inici si hi ha projectes a la barra lateral.
es: Ahora siempre se selecciona un proyecto como activo al iniciar si existen proyectos en la barra lateral
ja: 複数のプロジェクトがサイドバーに存在する場合、うち 1 つが起動時にアクティブなプロジェクトになるように修正
pl: Teraz przy starcie zawsze istnieje aktywny projekt gdy w panelu bocznym są projekty
pt_br: Agora sempre há um projeto ativo na inicialização se houver projetos na barra lateral
tr: Artık kenar çubuğunda projeler varsa başlangıçta her zaman etkin bir proje var

source: If a development branch is running this shows in the window title and in the dock tooltip
ca: Si s'està executant una branca de desenvolupament això es mostra al títol de la finestra i a la informació sobre eines de l'acoblador.
es: Si se está ejecutando una rama de desarrollo, se muestra en el título de la pantalla y la descripción emergente del Dock
ja: 開発ブランチ版を実行中の場合、ウィンドウタイトルとドックのツールチップにブランチ名を表示するように変更
pl: Jeśli uruchamiana jest wersja deweloperska to pojawia się to w nazwie okna i tooltipie w doku
pt_br: Se um branch de desenvolvimento estiver em execução, isso será exibido no título da janela e na dica de ferramenta do dock
tr: Bir geliştirme dalı çalışıyorsa bu, pencere başlığında ve dock araç ipucunda gösterilir

source: Ctrl+PageUp and Ctrl+PageDown shortcuts now switch tabs
ca: Les dreceres Ctrl+Pàgina amunt i Ctrl+Pàgina avall ara canvien de pestanya.
es: Ahora los atajos Ctrl+Re Pág. y Ctrl+Av Pág. cambian de pestañas
ja: Ctrl+PageUp と Ctrl+PageDown でタブを切り替えできるように変更
pl: Skróty klawiszowe Ctrl+PageUp i Ctrl+PageDown zmieniają teraz karty
pt_br: Os atalhos Ctrl+PageUp e Ctrl+PageDown agora alternam entre guias
tr: Ctrl+PageUp ve Ctrl+PageDown kısayolları artık sekmeleri değiştiriyor

source: Ensure active project at startup (include non-git folders)
ca: S'assegura que el projecte actiu a l'inici (inclou carpetes que no siguin git).
es: Ahora se asegura que exista un proyecto activo al iniciar (incluyendo proyecto que no son de Git)
ja: 起動時にアクティブなプロジェクトを確実に設定するように修正 (非 git 管理下のフォルダーも含む)
pl: Wymuszenie aktywnego folderu przy starcie (włączając w to foldery nie-gitowe)
pt_br: Garantir projeto ativo na inicialização (incluir pastas que não são repositórios Git)
tr: Başlangıçta etkin proje sağlansın (git olmayan klasörleri dahil)

source: Redesigned app icon
ca: Icona de l'aplicació redissenyada
es: Se rediseñó el icono de le aplicación
ja: アプリアイコンのデザインを変更
pl: Przeprojektowano ikonę aplikacji
pt_br: Ícone do aplicativo redesenhado
tr: Yeniden tasarlanan uygulama simgesi

source: New custom dark and light elementary styles for the source view
ca: Nous estils personalitzats foscos i clars per a la vista font
es: Se agregó un nuevo estilo claro y oscuro de elementary para la vista de código
ja: 編集画面に新しいダーク/ライトの elementary スタイルを追加
pl: Nowe dostosowane ciemne i jasne style elementary dla widoku źródła
pt_br: Adicionado novos estilos claro e escuro do elementary no visualizador de código
tr: Kaynak görünüm için yeni özel koyu ve açık elementary stilleri

source: Option to follow the system dark style preference
ca: Opció per seguir la preferència d'estil fosc del sistema
es: Se agregó una opción para seguir el estilo oscuro del sistema
ja: システムのダークモード設定に従うオプションを追加
pl: Możliwość ustawienia trybu ciemnego na podstawie ustawień systemu
pt_br: Opção para seguir a preferência de estilo escuro do sistema
tr: Sistem koyu renk tema tercihini takip etme seçeneği eklendi

source: Ability to half tile on small notebook displays
ca: Capacitat de fer mig mosaic en pantalles de portàtils petites
es: En pequeños notebooks, se reduce el título de la ventana a la mitad
ja: 画面幅の小さなノートパソコンでもウィンドウをタイル表示できるように修正
pl: Możliwość do zmniejszenia o połowę kafelku na ekranach notebooków
pt_br: Em pequenos notebooks, reduza o título da janela para a metade
tr: Küçük dizüstü bilgisayar ekranlarında yarı döşeme yeteneği

source: Both Find on Page and Find in Project are now available from the app's menu instead of in the headerbar
ca: Tant Troba a la pàgina com Troba al projecte ara estan disponibles al menú de l'aplicació en lloc de a la barra de capçalera.
es: «Buscar en página» y «Buscar en el proyecto» están ahora disponibles desde el menú de la aplicación en vez de la barra de encabezado
ja: “ページ内を検索”および“プロジェクト内を検索”の両機能を、ヘッダーバーからアプリメニューに移動
pl: Zarówno Znajdź na stronie jak i Znajdź w projekcie są teraz dostępne z menu aplikacji zamiast z paska górnego
pt_br: Tanto Localizar na página quanto Localizar no projeto agora estão disponíveis no menu do aplicativo em vez de na barra de cabeçalho
tr: Hem Sayfada Bul hem de Projede Bul artık başlık çubuğundan ziyade uygulamanın menüsünden kullanılabilir

source: Options for hiding and showing panels are now all present in a compact set of linked buttons in the app's menu
ca: Les opcions per amagar i mostrar plafons ara estan totes presents en un conjunt compacte de botons enllaçats al menú de l'aplicació.
es: Opciones para ocultar y mostrar paneles están ahora presentes en un conjunto compacto de botones en el menú de la aplicación
ja: 各パネルを表示/非表示にするオプションを、アプリメニュー内のリンクボタンとして表示するように修正
pl: Opcje do chowania i pokazywania paneli są teraz dostępne w kompaktowym zbiorze połączonych przycisków w menu aplikacji
pt_br: As opções para ocultar e mostrar painéis agora estão todas presentes em um conjunto compacto de botões vinculados no menu do aplicativo
tr: Panelleri gizleme ve gösterme seçenekleri artık uygulamanın menüsünde kompakt bağlantılı düğmeler olarak mevcut

source: The sidebar now contains the project chooser button and fills the height of the window
ca: La barra lateral ara conté el botó de selecció de projectes i omple l'alçada de la finestra.
es: La barra lateral ahora contiene un botón para escoger el proyecto activo que tiene la altura del título de la ventana
ja: サイドバー: プロジェクト選択ボタンを追加し、表示領域をウィンドウの高さいっぱいに拡大
pl: Panel boczny zawiera teraz przycisk wybierania projektu oraz zajmuje całą wysokość okna
pt_br: A barra lateral agora contém o botão seletor de projetos e preenche a altura da janela
tr: Kenar çubuğu artık proje seçici düğmesini içeriyor ve pencerenin yüksekliğini dolduruyor

source: Starting a global search with text selected now pre-fills that text
ca: Iniciar una cerca global amb el text seleccionat ara preemplena aquest text.
es: Comenzar una búsqueda global con texto seleccionad ahora utiliza ese texto como búsqueda inicial
ja: テキストを選択した状態でプロジェクト内検索を開始すると、そのテキストを検索用語にした状態で検索ダイアログが開くように修正
pl: Rozpoczęcie globalnego wyszukiwania z zaznaczonym tekstem wykorzystuje teraz ten tekst
pt_br: Iniciar uma pesquisa global com texto selecionado agora preenche previamente esse texto
tr: Artık seçili metinle küresel bir arama başlatıldığında, söz konusu metin önceden dolduruluyor

source: The symbol outline pane is now shown to the right of the source view and can be shown and hidden with the keyboard shortcut "Alt + \"
ca: El plafó de contorn de símbols es mostra ara a la dreta de la vista font i es pot mostrar i amagar amb la drecera de teclat "Alt + \".
es: El panel de vista de esquema ahora se encuentra a la derecha de la vista de código, y se puede mostrar y ocultar con el atajo «Alt+\»
ja: シンボルアウトラインペインの表示位置をソース画面の右に移動させ、キーボードショートカット "Alt + \" で表示/非表示できるように修正
pl: Panel ze spisem symboli jest teraz pokazywany po prawej stronie kodu i może być pokazany lub schowany przy użyciu kombinacji „Alt + \”
pt_br: O painel de visualização de estrutura agora está localizado à direita da visualização de código e pode ser mostrado e ocultado com o atalho "Alt + \"
tr: Sembol anahat bölmesi artık kaynak görünümünün sağında gösteriliyor ve "Alt + \" klavye kısayoluyla gösterilip gizlenebiliyor

source: Terminal, Symbol outline, and the Strip Trailing Whitespace plugins are now part of the main codebase
ca: El terminal, l'esquema de símbols i els connectors de Strip Trailing Whitespace ara formen part de la base de codi principal.
es: El panel de la terminal, de vista de esquema y la extensión de eliminación de espacios en blanco ahora pertenecen a la base de código principal
ja: ターミナル/シンボルアウトライン/ファイル末尾の空白を削除 プラグインをメインのコードに組み込み
pl: Terminal, Spis symboli oraz Usuwanie końcowych białych znaków są teraz częścią głównego kodu
pt_br: Os plugins Terminal, Symbol outline e Strip Trailing Whitespace agora fazem parte da base de código principal
tr: Terminal, Sembol anahattı ve Strip Trailing Whitespace eklentileri artık ana kod tabanının bir parçası

source: Show an infobar when tab width settings are being overwritten by an EditorConfig file
ca: Mostra una barra d'informació quan la configuració de l'amplada de la pestanya la sobreescriu un fitxer d'EditorConfig.
es: Ahora se muestra un mensaje informativo cuando la configuración del ancho del tabulador se ha sobreescrito por un archivo de EditorConfig
ja: タブ幅の設定が EditorConfig ファイルで上書きされている場合は、情報バーを表示するように修正
pl: Gdy ustawienia szerokości wcięcia są zarządzane przez plik EditorConfig pokazywany jest panel z informacją
pt_br: Mostrar uma barra de informações quando as configurações de largura da guia estiverem sendo substituídas por um arquivo EditorConfig
tr: Sekme genişliği ayarları bir EditorConfig dosyası tarafından üzerine yazıldığında bir bilgi çubuğu göster

source: The shortcut for rebuilding the completion word list is now "Ctrl + |"
ca: La drecera per reconstruir la llista de paraules de compleció ara és "Ctrl + |".
es: El atajo para reconstruir la lista de palabras a completar es ahora «Ctrl + |»
ja: 単語補完の単語一覧を更新するショートカットキーを "Ctrl + |" に変更
pl: Skrót klawiszowy do przebudowania listy podpowiadanych słów to teraz „Ctrl + |”
pt_br: O atalho para reconstruir a lista de palavras a concluir agora é "Ctrl + |"
tr: Tamamlama sözcük listesini yeniden oluşturmanın kısayolu artık "Ctrl + |"

source: The current document filename is now shown as the window title in multitasking view
ca: El nom del fitxer del document actual es mostra ara com a títol de la finestra a la vista de multitasca.
es: El nombre de archivo del documento actual ahora se muestra como el título de la ventana en la Vista Multitarea
ja: マルチタスク画面でのウィンドウタイトルとして、現在編集中のファイル名を使用するように変更
pl: Nazwa pliku aktualnego dokumentu jest teraz pokazywana jako tytuł okna w widoku wielozadaniowym
pt_br: O nome do arquivo do documento atual agora é exibido como o título da janela na visualização multitarefa
tr: Geçerli belgenin dosya adı artık çoklu görev görünümünde bir pencere başlığı olarak gösteriliyor

source: Hidden folders are now shown in the project sidebar
ca: Les carpetes ocultes ara es mostren a la barra lateral del projecte.
es: Las carpetas ocultas ahora se muestran en la barra lateral del proyecto
ja: 隠しフォルダーもプロジェクトサイドバーで表示されるように修正
pl: Ukryte folder są teraz pokazywane w panelu bocznym projektu
pt_br: Pastas ocultas agora são mostradas na barra lateral do projeto
tr: Gizli klasörler artık proje kenar çubuğunda gösteriliyor

source: The currently selected result and the number of results is displayed while searching
ca: Durant la cerca es mostren el resultat seleccionat actualment i el nombre de resultats.
es: El resultado seleccionado actualmente y el número de resultados se muestran durante la búsqueda
ja: 現在選択している検索結果と検索数を、文字検索中も表示するように修正
pl: Aktualnie zaznaczony wynik i liczba wyników jest teraz pokazywane podczas wyszukiwania
pt_br: O resultado selecionado atualmente e o número de resultados são exibidos durante a pesquisa
tr: Şu anda seçili olan sonuç ve sonuç sayısı arama sırasında görüntülenir

source: The search bar now has a regular expression mode
ca: La barra de cerca ara té un mode d'expressió regular.
es: La barra de búsqueda ahora tiene un modo de expresión regular
ja: 検索バーに正規表現モードを搭載
pl: Pasek wyszukiwania posiada teraz tryb wyrażeń regularnych
pt_br: A barra de pesquisa agora tem um modo de expressão regular
tr: Arama çubuğunun şimdi düzenli ifade modu bulunmaktadır

source: Fixes:
ca: Correccions:
es: Correcciones:
ja: 修正点:
pl: Poprawki:
pt_br: Correções:
tr: Düzeltmeler:

source: It is now possible to change Git branch with untracked files present in a project
ca: Ara és possible canviar la branca de Git amb fitxers sense seguiment presents en un projecte.
es: Ahora es posible cambiar la rama de Git con archivos sin seguimiento presentes en un proyecto
ja: プロジェクトに追跡されていないファイルがある場合でも、ブランチを切り替えできるように修正
pl: Możliwe stała się zmiana gałęzi Git z nieśledzonymi plikami obecnymi w projekcie
pt_br: Agora é possível alterar o branch do Git com arquivos não rastreados presentes em um projeto
tr: Bir projede bulunan dokunulmamış dosyalar içeren Git dalını şimdi değiştirmeniz mümkün

source: Crashes are prevented while searching in large projects
ca: Les fallades s'eviten durant la cerca en projectes grossos.
es: Se evitan fallos durante la búsqueda en proyectos grandes
ja: 大規模なプロジェクト内で検索するとクラッシュする不具合を修正
pl: Zapobiegnięto błędom krytycznym podczas szukania w dużych projektach
pt_br: Falhas são evitadas durante pesquisas em grandes projetos
tr: Büyük projelerde arama yaparken oluşan çökmelerin önüne geçilmiştir
