Repository: yonas-forks/code
Catalog: po/*.po
Languages: be, pl

source: New Tab
be: Новая ўкладка
pl: Nowa karta

source: New Window
be: Новае акно
pl: Nowe okno

source: Print version info and exit
be: Паказаць інфармацыю аб версіі і выйсці
pl: Wyświetl informację o wersji i zamknij

source: Open file at specified selection range
be: Адкрыць файл з даным вылучэннем дыяпазону
pl: Otwórz plik w danym przedziale zaznaczenia

source: [FILE…]
be: [ФАЙЛ…]
pl: [PLIK…]

source: Code (%s)
be: Код (%s)
pl: Kod (%s)

source: Hide search bar
be: Схаваць поле пошуку
pl: Ukryj pasek wyszukiwania

source: Find on Page…
be: Знайсці на старонцы…
pl: Znajdź na stronie…

source: Hide Projects Sidebar
be: Схаваць панэль праектаў
pl: Ukryj panel boczny projektu

source: Show Projects Sidebar
be: Паказаць панэль праектаў
pl: Pokaż panel boczny projektu

source: Hide Symbol Outline
be: Схаваць абводку сімвалаў
pl: Ukryj przegląd symboli

source: Show Symbol Outline
be: Паказаць абводку сімвалаў
pl: Pokaż przegląd symboli

source: Hide Terminal
be: Схаваць Тэрмінал
pl: Ukryj terminal

source: Show Terminal
be: Паказаць Тэрмінал
pl: Pokaż terminal

source: All files
be: Усе файлы
pl: Wszystkie pliki

source: Text files
be: Тэкставыя файлы
pl: Pliki tekstowe

source: Open some files
be: Адкрыць некалькі файлаў
pl: Otwórz jakieś pliki

source: Open
be: Адкрыць
pl: Otwórz

source: Cancel
be: Скасаваць
pl: Anuluj

source: _Open
be: _Адкрыць
pl: _Otwórz

source: _Cancel
be: _Скасаваць
pl: _Anuluj

source: Unable to clone %s
be: Не атрымалася кланіраваць %s
pl: Nie udało się sklonować %s

source: Retry
be: Паспрабаваць зноў
pl: Ponów

source: Show '%s' with default app
be: Паказваць '%s' у прадвызначанай праграме
pl: Pokaż „%s” przy pomocy domyślnej aplikacji

source: Create a local clone of a Git repository
be: Зрабіць лакальную копію рэпазіторыя Git
pl: Stwórz lokalny klon repozytorium Git

source: The source repository and local folder must exist and have the required read and write permissions
be: Зыходны рэпазіторый і лакальная папка павінны існаваць і мець дазволы на запіс і чытанне
pl: Repozytorium źródłowe oraz lokalny katalog muszą istnieć i posiadać odpowiednie uprawnienia do odczytu i zapisu

source: Clone Repository
be: Кланіраваць рэпазіторый
pl: Sklonuj repozytorium

source: Select folder where the cloned repository will be created
be: Выберыце папку, дзе будзе створаны кланіраваны рэпазіторый
pl: Wybierz katalog w którym stworzone zostanie sklonowane repozytorium

source: Select
be: Выбраць
pl: Zaznacz

source: Repository URL
be: Спасылка на рэпазіторый
pl: URL repozytorium

source: Location
be: Размяшчэнне
pl: Lokalizacja

source: Name of Clone
be: Назва копіі
pl: Nazwa klona

source: Cloning in progress
be: Ідзе кланіраванне
pl: Klonowanie w toku

source: Search for text in “%s”
be: Шукаць тэкст у “%s”
pl: Znajdź tekst w „%s”

source: The search term must be at least 3 characters long.
be: Пошукавы запыт патрэбны быць як мінімум 3 сімвалы.
pl: Wyszukiwane wyrażenie musi mieć co najmniej 3 znaki.

source: Search
be: Пошук
pl: Szukaj

source: Create a new branch of “%s/%s”
be: Стварыць новую галіну “%s/%s”
pl: Utwórz nowy branch “%s/%s”

source: The branch name must be unique and follow Git naming rules.
be: Назва веткі павінна быць унікальнай і прытрымлівацца правіл Git.
pl: Nazwa brancha musi być unikatowa i stosować się do zasad nazywania Git.

source: Create Branch
be: Стварыць галіну
pl: Utwórz branch

source: Preferences
be: Налады
pl: Preferencje

source: General
be: Агульныя
pl: Ogólne

source: Save files when changed
be: Захоўваць файлы пры змяненні
pl: Zapisywanie plików po ich zmianie

source: Strip trailing whitespace on save
be: Пазбаўляцца ад задняга прабела пры захоўванні
pl: Usuwaj końcowe białe znaki przy zapisywaniu

source: Smart cut/copy lines
be: Разумнае капіраванне/выразанне радкоў
pl: Inteligentne wycinanie/kopiowanie linijek

source: Cutting or copying without an active selection will cut or copy the entire current line
be: Выразанне або капіраванне без актыўнага вылучэння выража ці скапіруе ўвесь радок
pl: Wycinanie lub kopiowanie bez aktywnego zaznaczenia spowoduje wycięcie lub skopiowanie całej linii

source: Indentation width
be: Шырыня выемкі
pl: Szerokość wcięcia

source: Indentation
be: Структураванне
pl: Wcięcia

source: Automatic indentation
be: Аўтаматычнае структураванне
pl: Wcięcie automatyczne

source: Insert spaces instead of tabs
be: Устаўляць прабелы замест табуляцый
pl: Wstawianie spacji zamiast znaku tabulatora

source: Default build directory
be: Прадвызначаны каталог для будавання
pl: Domyślny katalog budowania

source: Projects
be: Праекты
pl: Projekty

source: None
be: Нічога
pl: Żadne

source: Current Line
be: Бягучы радок
pl: W aktualnej linii

source: All
be: Усё
pl: Wszystkie

source: Whitespace visible when not selected
be: Адлюстроўваць прабелы, які не вылучаны
pl: Białe znaki widoczne gdy niezaznaczone

source: Editor
be: Рэдактар
pl: Edytor

source: Highlight matching brackets
be: Падсвечваць парныя дужкі
pl: Podświetlanie pasujących nawiasów

source: Mini Map
be: Міні карта
pl: Mini mapa

source: Wrap lines
be: Перанасіць радкі
pl: Łamanie linii

source: Line width guide
be: Паказчык даўжыні радку
pl: Szerokość prawego marginesu

source: Font
be: Шрыфт
pl: Czcionka

source: Use system font
be: Выкарыстоўваць сістэмны шрыфт
pl: Użyj fontu systemowego

source: Behavior
be: Паводзіны
pl: Zachowanie

source: Interface
be: Інтэрфейс
pl: Interfejs

source: Extensions
be: Пашырэнні
pl: Wtyczki

source: Close
be: Закрыць
pl: Zamknij

source: Are You Sure You Want to Restore This File?
be: Вы ўпэўнены, што хочаце аднавіць гэты файл?
pl: Czy na pewno chcesz przywrócić ten plik?

source: Restoring a file will undo all changes made since opening it
be: Аднаўленне файла скасуе ўсе змены, якія вы да яго прымянілі
pl: Przywrócenie pliku spowoduje cofnięcie wszystkich zmian wprowadzonych od czasu jego otwarcia

source: Don't Restore
be: Не аднаўляць
pl: Nie przywracaj

source: Restore Anyway
be: Усё роўна аднавіць
pl: Przywróć mimo wszystko

source: This folder is the parent of an open project
be: Гэта бацькоўская папка для адкрытага праекту
pl: Ten folder jest nadrzędny dla otwartego projektu

source: Opening this folder will close the child project
be: Адкрыццё гэтай папкі прывядзе да закрыцця даччынага праекту
pl: Otworzenie tego folderu zamknie projekt podrzędny

source: Close Child Project
be: Закрыць даччыны праект
pl: Zamknij projekt podrzędny

source: This folder is a child of an open project
be: Гэта папка з'яўляецца даччынай адкрытага праекта
pl: Ten folder jest podrzędny dla otwartego projektu

source: Opening this folder will close the parent project
be: Адкрыццё гэтай папкі прывядзе да закрыцця бацькоўскага праекту
pl: Otwarcie tego projektu zamknie projekt nadrzędny

source: Close Parent Project
be: Закрыць бацькоўскі праект
pl: Zamknij projekt nadrzędny

source: Don't Open
be: Не адкрываць
pl: Nie otwieraj

source: There are uncommitted changes in the current branch
be: У галінцы ёсць незапісаныя змены
pl: Istnieją niescommitowane zmiany w aktualnym odgałęzieniu

source: Uncommitted changes will be permanently lost if <b>'%s'</b> is checked out now. <i>It is recommended that uncommitted changes are stashed, committed, or reverted before proceeding.</i>
be: Незапісаныя змены будуць назаўжды страчаны, калі зараз будзе пазначана <b>'%s'</b>. <i>Рэкамендуецца запісаць або адрабіць змены перад працягам.</i>
pl: Niescommitowane zmiany zostaną na zawsze stracone jeśli <b>'%s'</b> zostanie teraz otwarty. <i>Zalecane jest by niescommitowane zmiany zostały przechowane w stashu, scommitowane, lub odrzucone przed kontynuowaniem.</i>

source: Do not Checkout
be: Не рабіць Checkout
pl: Nie otwieraj gałęzi

source: Checkout and Overwrite
be: Зрабіць Checkout і перазапісаць
pl: Otwórz gałąź i nadpisz

source: Other Actions
be: Іншыя дзеянні
pl: Inne działania

source: Rename
be: Перайменаваць
pl: Zmień nazwę

source: Move to Trash
be: Перамясціць у сметніцу
pl: Przenieś do kosza

source: Other Application…
be: Іншая праграма…
pl: Inny program…

source: Open In
be: Адкрыць у
pl: Otwórz w

source: Folders
be: Папкі
pl: Foldery

source: Find in Folder…
be: Знайсці ў папке…
pl: Znajdź w folderze…

source: Terminal Pane
be: Панэль тэрмінала
pl: Panel terminala

source: Folder
be: Папка
pl: Katalog

source: Empty File
be: Пусты файл
pl: Pusty plik

source: New
be: Стварыць
pl: Nowy

source: untitled folder
be: папка без назвы
pl: Katalog bez nazwy

source: new file
be: новы файл
pl: nowy plik

source: Set as Active Project
be: Назначыць актыўным праектам
pl: Ustaw jako aktywny projekt

source: Open in Terminal Pane
be: Адкрыць у панэлі тэрмінала
pl: Otwórz w panelu Terminala

source: Close Folder
be: Закрыць папку
pl: Zamknij folder

source: Close Other Folders
be: Закрыць іншыя папкі
pl: Zamknij inne foldery

source: Close %u Open Document
be: Закрыць %u адкрыты дакумент
pl: Zamknij %u otwarty dokument

source: Hide %u Open Document
be: Схаваць %u адкрыты дакумент
pl: Schowaj %u otwarty dokument

source: Restore %u Hidden Document
be: Аднавіць %u схаваны дакумент
pl: Przywróć %u otwarty dokument

source: Find in Project…
be: Знайсці ў праекце…
pl: Znajdź w projekcie…

source: Local
be: Лакальна
pl: Lokalne

source: Remote
be: Аддалена
pl: Zdalne

source: New Branch…
be: Новая галіна…
pl: Nowy branch…

source: Branch
be: Галіна
pl: Gałąź

source: Modified
be: Зменена
pl: Zmodyfikowano

source: Error while creating new branch: “%s”
be: Памылка стварэння новай галіны: “%s”
pl: Błąd podczas tworzenia nowego brancha: “%s”

source: %s Is Not a Text File
be: %s не з'яўляецца тэкставым файлам
pl: %s nie jest plikiem tekstowym

source: Code will not load this type of file.
be: Code не можа загрузіць гэты тып файла.
pl: Kod nie wczyta tego rodzaju plików.

source: Load Anyway
be: Усё роўна загрузіць
pl: Wczytaj mimo wszystko

source: Loading File “%s” Is Taking a Long Time
be: Загрузка файла “%s” займае занадта доўга
pl: Wczytywanie pliku „%s” trwa długi czas

source: Please wait while Code is loading the file.
be: Калі ласка, пачакайце пакуль Code загрузіць файл.
pl: Prosimy oczekiwać podczas wczytywania pliku przez Kod.

source: Cancel Loading
be: Скасаваць загрузку
pl: Anuluj wczytywanie

source: Save changes to “%s” before closing?
be: Захаваць змены ў %s перад закрыццём?
pl: Zachować zmiany w pliku „%s” przed zamknięciem?

source: If you don't save, changes will be permanently lost.
be: Калі вы не захаваеце, змены за апошнія 4 секунды будуць назаўсёды страчаныя.
pl: Jeśli plik nie zostanie zapisany, zmiany zostaną bezzwrotnie utracone.

source: Close Without Saving
be: Закрыць не захоўваючы
pl: Zamknij bez zapisywania

source: Save
be: Захаваць
pl: Zapisz

source: Saving to “%s” failed.
be: Не ўдалося захаваць у “%s”.
pl: Zapisywanie do pliku „%s” nie powiodło się.

source: Save File
be: Захаваць файл
pl: Zapisz plik

source: New Document
be: Новы дакумент
pl: Nowy dokument

source: Cannot save this document to %s
be: Нельга захаваць гэта дакумент у %s
pl: Nie można zapisać dokumentu do %s

source: Cannot read text in file “%s”
be: Нельга прачытаць тэкст з файла “%s”
pl: Nie udało się przeczytać tekstu w „%s”

source: You may not have permission to read the file.
be: Магчыма, у вас няма дазволу на чытанне гэтага файла.
pl: Możesz nie posiadać wystarczających uprawnień do odczytania pliku.

source: The file may be corrupt or may not be a text file
be: Файл можа быць пашкоджаны альбо не з'яўляцца тэкставым
pl: Plik może być uszkodzony lub może nie być plikiem tekstowym

source: Show Anyway
be: Усё роўна паказаць
pl: Pokaż mimo to

source: The location containing the file “%s” was unmounted and there are unsaved changes.
be: Месца з файлам "%s" было адмацавана, але ёсць незахаваныя змены.
pl: Położenie zawierające plik „%s” zostało odłączone i istnieją niezapisane zmiany.

source: File “%s” was deleted, renamed or moved and there are unsaved changes.
be: Файл "%s" быў выдалены, перайменаваны або перамешчаны, але ёсць незахаваныя змены.
pl: Plik „%s” został usunięty, przeniesiony lub zmieniono mu nazwę, a istnieją niezapisane zmiany.

source: File “%s” does not have write permission.
be: У файла “%s” няма дазволу на запіс.
pl: Plik „%s” nie ma uprawnień do zapisywania.

source: File “%s” was modified by an external application
be: Файл "%s" быў зменены знешняй праграмай
pl: Plik „%s” został zmieniony przez zewnętrzną aplikację

source: There are also unsaved changes. Reloading the document will overwrite the unsaved changes.
be: Таксама ёсць незахаваныя змены. Абнаўленне дакумента прывядзе да іх перазапісу.
pl: Istnieją również niezapisane zmiany. Przeładowanie dokumentu nadpisze niezapisane zmiany.

source: The document changed externally since you last saved it.
be: Дакумент быў вонкава зменены з таго моманту, калі вы захавалі яго апошні раз.
pl: Dokument został zmieniony przez aplikację zewnętrzną od czasu ostatniego zapisu.

source: “%s” can't be saved here. Save a duplicate somewhere else?
be: “%s” нельга захаваць тут. Захаваць дакумент дзесьці яшчэ?
pl: „%s” nie może być tutaj zapisany. Zapisać kopię w innym miejscu?

source: Ignore
be: Ігнараваць
pl: Zignoruj

source: Save Duplicate…
be: Захаваць копію…
pl: Zapisz kopię…

source: Continue
be: Працягваць
pl: Kontynuuj

source: Reload
be: Перазагрузіць
pl: Przeładuj

source: Overwrite
be: Перазапісаць
pl: Nadpisz

source: Save Document elsewhere
be: Захаваць дакумент ў іншым месцы
pl: Zapisz dokument gdzie indziej

source: Remote Branch '%s' not found
be: Аддаленая галіна '%s' не знойдзена
pl: Zdalna gałąź „%s” nie odnaleziona

source: The requested branch was not found in any remote linked to this repository
be: Патрэбная галіна не была знойдзена ў гэтым рэпазіторыі
pl: Wybrana gałąź nie została znaleziona w żadnym zdalnym punkcie powiązanym z tym repozytorium

source: An error occurred while checking out the requested branch
be: Падчас праверкі галіны паўстала памылка
pl: Podczas przełączania się na wybraną gałąź wystąpił błąd

source: %.8s (detached)
be: %.8s (адлучаны)

source: Templates
be: Шаблоны
pl: Szablony

source: Symbols
be: Сімвалы
pl: Symbole

source: Too Many Symbols
be: Зашмат сімвалаў
pl: Zbyt wiele symboli

source: %s contains too many Vala symbols. Parsing and showing them took too long.
be: %s змяшчае занадта шмат сімвалаў Vala. Іх апрацоўка і адлюстраванне заняла зашмат часу.
pl: %s zawiera zbyt wiele symboli Vala. Parsowanie i pokazywanie ich zajęło zbyt długo.

source: Vala symbols found in %s
be: Сімвалы Vala знойдзены ў %s
pl: Symbole Vala znalezione w %s

source: Class
be: Клас
pl: Klasa

source: Property
be: Уласцівасць
pl: Pole

source: Signal
be: Сігнал
pl: Sygnał

source: Method
be: Метад
pl: Metoda

source: Struct
be: Структура
pl: Struktura

source: Enum
be: Пералік
pl: Wyliczenie

source: Constant
be: Канстанта
pl: Stała

source: Constructor
be: Канструктар
pl: Konstruktor

source: Namespace
be: Прастора назваў
pl: Przestrzeń nazw

source: Other
be: Іншае
pl: Inne

source: Find Symbol
be: Пошук сімвалаў
pl: Znajdź symbol

source: Filter symbol type
be: Адфільтраваць па тыпу
pl: Filtruj po typie symbolu

source: Select All
be: Выбраць усё
pl: Zaznacz wszystko

source: Deselect All
be: Знаць выбранае
pl: Odznacz wszystko

source: No Project Selected
be: Праект не выбраны
pl: Nie wybrano projektu

source: Active Git Project: %s
be: Актыўны праект Git: %s
pl: Aktywny projekt Git: %s

source: Filter projects
be: Адфільтраваць праекты
pl: Filtruj projekty

source: Open Folder…
be: Адкрыць папку…
pl: Otwórz katalog…

source: Clone Git Repository…
be: Кланіраваць рэпазіторый Git…
pl: Sklonuj repozytorium Git…

source: Closed Tabs
be: Закрытыя папкі
pl: Zamknięte karty

source: Text file from %s:%d
be: Тэкставы файл з %s:%d
pl: Plik tekstowy z %s:%d

source: Close Tabs to the Right
be: Закрыць укладкі справа
pl: Zamknij karty po prawej

source: Close Other Tabs
be: Закрыць іншыя ўкладкі
pl: Zamknij inne karty

source: Close Tab
be: Закрыць укладку
pl: Zamknij kartę

source: Open in New Window
be: Адкрыць у новым акне
pl: Otwórz w nowym oknie

source: Duplicate Tab
be: Дубліраваць укладку
pl: Zduplikuj kartę

source: Syntax Highlighting
be: Падсветка сінтаксісу
pl: Wyróżnienie składni

source: Line number
be: Нумары радкоў
pl: Numer wiersza

source: Filter languages
be: Фільтраваць мовы
pl: Filtrowanie języków

source: Plain Text
be: Звычайны тэкст
pl: Tekst bez formatowania

source: Some settings set by EditorConfig file
be: Некаторыя налады былі ўзятыя з файла EditorConfig
pl: Niektóre ustawienia ustawione przy użyciu pliku EditorConfig

source: Automatic Indentation
be: Аўтаматычныя выступы
pl: Wcięcie automatyczne

source: Insert Spaces Instead Of Tabs
be: Устаўляць прабелы замест табуляцый
pl: Wstawianie spacji zamiast znaku tabulatora

source: Tab width
be: Шырыня табуляцыі
pl: Szerokość tabulacji

source: Go To Line:
be: Перайсці да радку:
pl: Przechodzenie do wiersza:

source: %d Space
be: %d прабел
pl: Jedna spacja

source: %d Tab
be: %d укладка
pl: Jeden tabulator

source: Open a file
be: Адкрыццё файла
pl: Otwiera plik

source: Project templates
be: Шаблоны праектаў
pl: Szablony projektów

source: Save this file
be: Захаваць гэты файл
pl: Zapisz ten plik

source: Save this file with a different name
be: Захаваць гэты файл з іншай назвай
pl: Zapisz ten plik pod inną nazwą

source: Restore this file
be: Аднавіць гэты файл
pl: Przywraca zawartość bieżącego pliku

source: Share
be: Падзяліцца
pl: Udostępnia dokument

source: Zoom Out
be: Паменшыць маштаб
pl: Pomniejszenie

source: Zoom 1:1
be: Маштаб 1:1
pl: Skala 1:1

source: Zoom In
be: Павялічыць маштаб
pl: Powiększenie

source: Follow System Style
be: Выкарыстоўваць сістэмны стыль
pl: Na podstawie stylu systemu

source: Menu
be: Меню

source: Collapse All
be: Згарнуць усё
pl: Zwiń wszystkie

source: Alphabetize
be: Па алфавіту
pl: Ułóż alfabetycznie

source: Manage project folders…
be: Кіраванне папкамі праекта…
pl: Zarządzaj katalogami projektu…

source: Find
be: Знайсці
pl: Znajdź

source: No Results
be: Няма рэзультатаў
pl: Brak wyników

source: Search next
be: Шукаць далей
pl: Wyszukaj następne

source: Search previous
be: Шукаць раней
pl: Wyszukaj poprzednie

source: Cyclic Search
be: Цыклічны пошук
pl: Cykliczne wyszukiwanie

source: Never
be: Ніколі
pl: Nigdy

source: Mixed Case
be: Змешаны рэгістр
pl: Różnymi literami

source: Always
be: Заўжды
pl: Zawsze

source: Case Sensitive
be: З улікам рэгістра
pl: Wielkość liter ma znaczenie

source: Use Regular Expressions
be: Выкарыстоўваць рэгулярныя выражэнні
pl: Użyj wyrażeń regularnych

source: Match Whole Words
be: Шукаць агульныя словы
pl: Dopasuj całe słowa

source: Search Options
be: Налады пошуку
pl: Opcje wyszukiwania

source: Replace With
be: Замяніць на
pl: Zastąp przez

source: Replace
be: Замяніць
pl: Zastąp

source: Replace all
be: Замяніць усё
pl: Zastąp wszystko

source: %d of %d
be: %d з %d
pl: %d z %d

source: no results
be: няма рэзультатаў
pl: brak wyników

source: Sort Selected Lines
be: Адсартаваць вылучаныя радкі
pl: Sortuj wybrane wiersze

source: Mark Current Line
be: Адзначыць бягучы радок
pl: Zaznacz aktualną linię

source: Goto Previous Edit Mark
be: Перайсці да мінулай пазнакі
pl: Idź do poprzedniej zakładki edycyjnej

source: Goto Next Edit Mark
be: Перайсці да наступнай пазнакі
pl: Idź do następnej zakładki edycyjnej

source: Toggle Comment
be: Пераключыць каментарый
pl: Przełącz komentarze

source: Copy
be: Капіраваць
pl: Kopiuj

source: Paste
be: Уставіць
pl: Wklej

source: No Files Open
be: Няма адкрытых файлаў
pl: Żadne pliki nie są otwarte

source: Open a file to begin editing.
be: Адкрыйце файл, каб пачаць рэдагаваць.
pl: Proszę otworzyć plik, aby rozpocząć pracę.

source: New File
be: Стварыць файл
pl: Nowy plik

source: Create a new empty file.
be: Стварыць новы пусты файл.
pl: Tworzy nowy pusty plik.

source: Open File
be: Адкрыць файл
pl: Otwórz plik

source: Open a saved file.
be: Адкрыць захаваны файл.
pl: Otwiera zapisany plik.

source: Open Folder
be: Адкрыць папку
pl: Otwórz katalog

source: Add a project folder to the sidebar.
be: Дадаць папку з праектам на панэль.
pl: Dodaj katalog projektu do panelu bocznego.

source: Upload to Pastebin
be: Запампаваць на Pastebin
pl: Prześlij do Pastebin

source: Name:
be: Назва:
pl: Nazwa:

source: Format:
be: Фармат:

source: Choose different format
be: Выбраць іншы фармат
pl: Wybierz inny format

source: Expiration:
be: Тэрмін дзеяння:
pl: Czas wygaśnięcia:

source: Keep this paste private
be: Захоўваць гэтую ўстаўку прыватнай
pl: Prywatna wklejka

source: Available Formats
be: Даступныя фарматы
pl: Dostępne formaty

source: Select Format
be: Выбраць фармат
pl: Wybierz format

source: Ten minutes
be: Дзесяць хвілін
pl: 10 minut

source: One hour
be: Адна гадзіна
pl: Godzina

source: One day
be: Адзін дзень
pl: Jeden dzień

source: One month
be: Адзін месяц
pl: Jeden miesiąc

source: No Suitable Dictionaries Were Found
be: Не знойдзена адпаведных слоўнікаў
pl: Nie znaleziono żadnych odpowiednich katalogów

source: Please install at least one [aspell] dictionary.
be: Калі ласка, усталюйце прынамсі адзін слоўнік [aspell].
pl: Proszę zainstalować chociaż jeden słownik [aspell].

source: %s - Word Completion
be: %s - Дапаўненне слоў
pl: %s - uzupełnienie słowa

source: <START_LINE[.START_COLUMN][-END_LINE[.END_COLUMN]]>
pl: <LINIA_POCZĄTKOWA[.KOLUMNA_POCZĄTKOWA][-LINIA_KOŃCOWA[.KOLUMNA_KOŃCOWA]]>

source: Code
pl: Kod

source: https://example.com/username/projectname.git
pl: https://example.com/nazwa_uzytkownika/nazwa_projektu.git
