Repository: yonas-forks/code
Catalog: po/plugins/*.po
Languages: ca, ckb, de, hu, sl, tr, zh_tw

source: Brackets Completion
ca: Compleció de parèntesis
ckb: تەواوکردنی کەوانەکان
de: Klammervervollständigung
hu: Zárójel-kiegészítés
sl: Zaključevanje zaklepajev
tr: Parantez Tamamlama
zh_tw: 括號補完

source: Complete brackets while typing
ca: Completa els parèntesis mentre s'escriu
ckb: تەواوکردنی کەوانەکان لە کاتی نووسین
de: Klammern während der Eingabe vervollständigen
hu: Kiegészíti a megkezdett zárójelet
sl: Avtomatično zaključevanje zaklepajev med tipkanjem
tr: Parantezleri yazarken tamamla
zh_tw: 打字時補完括號

source: Detect Indent
ca: Detecta el sagnat
ckb: دیاریکردنی بۆشایی سەرەتای دێڕ
de: Einzug erkennen
hu: Bekezdés érzékelése
sl: Zaznavanje zamika
tr: Girintiyi Algıla
zh_tw: 偵測縮排

source: Heuristically detect tab or space settings
ca: Detecta els paràmetres del tabulador o de l'espai heurísticament
ckb: دیارخستنی تاب یان ڕێکخستنەکانی بۆشایی
de: Heuristische Erkennung von Tabulator- oder Leerzeichenwerten
hu: Tabulatúra vagy szóközök helyének heurisztikus észlelése
sl: Avtomatično prepoznavanje zamikov s tab ali presledkom
tr: Sekme veya boşluk ayarlarını sezgisel olarak tespit et
zh_tw: 啟發式偵測 Tab 或空白設定

source: EditorConfig
ca: Editor de configuració
ckb: دەستکاریکەری کۆنفیگ (EditorConfig)
zh_tw: 操作編輯 (EditorConfig)

source: Load settings from an EditorConfig file
ca: Carrega paràmetres d'un fitxer de l'editor de configuració
ckb: هێنانی ڕێکخستنەکان لە پەڕگەیەکی EditorConfigەوە
de: Einstellungen aus einer EditorConfig-Datei laden
hu: Beállítások betöltése egy konfigurációs fájlból
sl: Naloži nastavitve z EditorConfig datoteke
tr: Ayarları bir EditorConfig dosyasından yükle
zh_tw: 從 EditorConfig 檔案讀取設定

source: Find Project Files
ca: Cerca fitxers de projecte
de: Projektdateien suchen
hu: Projektfájlok keresése
tr: Proje Dosyalarını Bul
zh_tw: 尋找專案檔案

source: Fuzzy search for files in all open projects (Show using ALT + F)
ca: Cerca difusa de fitxers en tots els projectes oberts (Mostra-ho amb ALT + F)
de: Unscharfe Suche nach Dateien in allen geöffneten Projekten (anzeigen mit Alt + F)
hu: Az összes megnyitott projekt fájljainak keresése (ALT + F-fel működik)
tr: Tüm açık projelerdeki dosyalar için yaklaşık arama (ALT + F kullanarak göster)
zh_tw: 在所有已開啟專案中進行模糊搜尋（用 ALT + F 來顯示）

source: Highlight Word Selection
ca: Realça la selecció de paraules
ckb: بەرچاوکردنی وشە دیاریکراوەکان
de: Wortauswahl hervorheben
hu: Kijelölt szavak kiemelése
sl: Označevanje izbrane besede
tr: Kelime Seçimini Vurgula
zh_tw: 標明單字選取

source: Highlights all occurrences of words that are selected
ca: Realça totes les ocurrències de paraules que estan seleccionades
ckb: تیشک خستنە سەر هەموو ئەو وشە هاتووانەی کە دیاریکراون
de: Alle Vorkommen der markierten Wörter hervorheben
hu: Kiemeli a kijelölt szavak összes előfordulását
sl: Označi vse ponovitve izbranih besed
tr: Seçilmiş olan tüm kelime oluşumlarını vurgula
zh_tw: 標明選取單字的全部出現處

source: Markdown Actions
ca: Accions de Markdown
ckb: کردارەکانی مارکداون
hu: Markdown műveletek
tr: Markdown Eylemleri
zh_tw: Markdown 動作

source: Adds keyboard shortcuts for quick editing Markdown files
ca: Afegiu dreceres de teclat per editar ràpidament fitxers de Markdown
ckb: زیادکردنی کورتەڕێی تەختەکلیل بۆ دەستکاریکردنی خێرای پەڕگەکانی مارکداون
de: Fügt Tastenkombinationen zum schnellen Bearbeiten von Markdown Dateien hinzu
hu: Billentyűparancsok markdown-fájlok gyors szerkesztéséhez
tr: Markdown dosyalarını hızlı bir şekilde düzenlemek için klavye kısayolları ekler
zh_tw: 加入快速編輯 Markdown 檔案用的鍵盤快捷鍵

source: Pastebin
ca: Cubell d'enganxar
ckb: پەیست بین (Pastebin)

source: Share files with pastebin service
ca: Compartiu fitxers amb el servei de Pastebin
ckb: هاوبەشی پێکردنی پەڕگەکان لەگەڵ خزمەتگوزاری پەیست بین
de: Dateien über Pastebin teilen
hu: Fájlok megosztása pastebin szolgáltatással
sl: Deljenje datotek s storitvijo pastebin
tr: Dosyaları pastebin servisi ile paylaş
zh_tw: 透過 Pastebin 服務分享檔案

source: Preserve Indent
ca: Preserva el sagnat
ckb: پاراستنی بۆشایی سەرەتای دێڕ
de: Einzug beibehalten
hu: Behúzás megőrzése
sl: Ohrani zamik
tr: Girintiyi Koru
zh_tw: 保留縮排

source: Maintains relative indent level of pasted text
ca: Manté el nivell de sagnat relatiu del text que s'enganxa
ckb: ئاستی ڕێژەیی بۆشایی سەرەتای دێڕ لە دەقی لێدراو دەپارێزێت
de: Relative Einzugsebene des eingefügten Textes beibehalten
hu: A beágyazott szöveg relatív behúzási szintjének fenntartása
sl: Ohrani zamik teksta pri lepljenju
tr: Yapıştırılan metnin göreceli girinti seviyesini korur
zh_tw: 保留貼上文字的相對縮排層級

source: Spell Checker
ca: Comprovació d'ortografia
ckb: هەڵەچن
de: Rechtschreibprüfung
hu: Helyesírás-ellenőrző
sl: Črkovanje
tr: Yazım Denetleyicisi
zh_tw: 拼字檢查器

source: Checks the spelling of your documents
ca: Comprova l'ortografia dels documents
ckb: هەڵەچنی ڕێنووسی دۆکیومێنتەکانت دەکات
de: Rechtschreibung in Dokumenten prüfen
hu: Ellenőrzi a helyesírást a dokumentumaiban
sl: Preverjanje črkovanja in slovničnih napak v dokumentu
tr: Belgelerinizde yazım denetimi yapar
zh_tw: 檢查您文件的拼字

source: Vim Emulation
ca: Emulació de Vim
ckb: ئیمیولەیشنی ڤیم
hu: Vim emuláció
sl: Emulacija Vim
tr: Vim Emülasyonu
zh_tw: Vim 仿擬

source: Use Vim commands in Code
ca: Usa ordres de Vim al Codi
ckb: بەکارهێنانی فەرمانەکانی ڤیم لە ئەپی کۆد
de: Vim-Kommandos in Code benutzen
hu: Vim parancsok használata a Kódban
sl: Omogoči uporabo Vim ukazov
tr: Kod uygulamasında Vim komutlarını kullan
zh_tw: 在 Code 中使用 Vim 指令

source: Words Completion
ca: Compleció de paraules
ckb: تەواوکاری وشەکان
de: Wortvervollständigung
hu: Szavak kiegészítése
sl: Dokončevanje besed
tr: Kelime Tamamlama
zh_tw: 單字補完

source: Show a completion dialog with most used words from your files
ca: Mostra un diàleg de compleció amb les paraules més usades segons els vostres fitxers
ckb: دیالۆگێکی تەواوکەر پیشان بدە کە زۆربەی وشە بەکارهێنراوەکان لە پەڕگەکانتەوە لەخۆ بگرێت
de: Dialog mit den in Ihren Dateien am häufigsten verwendeten Wörtern anzeigen
hu: Egy kiegészítő párbeszédablak megjelenítése a fájljaiban legtöbbet használt szavakkal
sl: Pokaže dialog za dokončevanje najbolj pogostih besed iz vaših datotek
tr: Dosyalarınızdaki en çok kullanılan kelimeler için bir tamamlama iletişim kutusu göster
zh_tw: 顯示從您檔案中取中最常使用單字的補完對話窗
